ruby_app/app/views/products/index.html.erb

            <%= form_for OrderProduct.new do |form| %>
            <%= form.collection_select :order_id, Order.where(buyer_id:current_user.id), :id, :delivery_key %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."buyer_id" = ?  [["buyer_id", 1]]