ruby_app/app/controllers/addresses_controller.rb

  def show
    @address = Address.find_by(id: params[:id])
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def new
    @address = Address.new
    @users = User.all()
---
SELECT "users".* FROM "users"

  def create
    #@address = Address.new(address_params)
    puts(address_params)

    @address = Address.new(user_id: address_params[:user_id].to_i,
                           commune: address_params[:commune],
                           street: address_params[:street],
                           number_address: address_params[:number_address],
                           extra_information: address_params[:extra_information])

    respond_to do |format|
      if @address.save
---
INSERT INTO "addresses" ("commune", "street", "number_address", "extra_information", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)