ruby_app/app/controllers/comments_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def new
    @order = Order.find(params[:order_id])

INSERT INTO "comments" ("message", "order_id", "buyer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["message", "Todo bien"], ["order_id", 8], ["buyer_id", 1], ["created_at", "2022-11-08 14:02:28.551364"], ["updated_at", "2022-11-08 14:02:28.551364"]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save