ruby_app/app/controllers/order_products_controller.rb

SELECT "order_products".* FROM "order_products"
---
  def index
    @order_products = OrderProduct.all

INSERT INTO "order_products" ("quantity", "order_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["quantity", nil], ["order_id", 2], ["product_id", 1], ["created_at", "2022-11-06 19:39:57.904834"], ["updated_at", "2022-11-06 19:39:57.904834"]]
---
  def create
    @order_product = OrderProduct.new(order_product_params)

    respond_to do |format|
      if @order_product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_products".* FROM "order_products" WHERE "order_products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_order_product
      @order_product = OrderProduct.find(params[:id])