ruby_app/app/controllers/orders_controller.rb

INSERT INTO "orders" ("status_order", "order_delivery_date", "order_date", "delivery_key", "buyer_id", "provider_id", "dispatcher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save

UPDATE "orders" SET "order_delivery_date" = ?, "order_date" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["order_delivery_date", "2022-10-12 15:36:25"], ["order_date", "2022-10-11 15:36:25"], ["updated_at", "2022-10-11 15:36:29.717080"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @order.update(order_params)