ruby_app/app/controllers/products_controller.rb

INSERT INTO "products" ("price", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["price", 2500.0], ["description", "Amazing!!"], ["created_at", "2022-11-06 03:51:52.439385"], ["updated_at", "2022-11-06 03:51:52.439385"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "updated_at" = ? WHERE "products"."id" = ?  [["updated_at", "2022-11-08 16:09:43.796343"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)