ruby_app/app/controllers/vehicles_controller.rb

  def create
    @vehicle = Vehicle.new(vehicle_params)

    respond_to do |format|
      if @vehicle.save
---
INSERT INTO "vehicles" ("patente", "information", "vehicle_type", "dispatcher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["patente", "AH5576"], ["information", "Vrooom!!"], ["vehicle_type", "bicicleta"], ["dispatcher_id", 3], ["created_at", "2022-11-06 20:04:37.435288"], ["updated_at", "2022-11-06 20:04:37.435288"]]