ruby_app/app/views/addresses/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <td> <%= address.number_address %> </dt>
      <td> <%= User.find(address.user_id).first_name %> </dt>