ruby_app/app/controllers/users/registrations_controller.rb

  def create
    @user = User.new(user_params)

puts "custom error message"

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "first_name", "last_name", "user_type", "phone_number", "location", "RUT") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)