ruby_app/app/views/orders/_form.html.erb

SELECT "users".* FROM "users" WHERE "users"."user_type" = ?  [["user_type", "Comprador"]]
---
      <h5><strong> Compradores Disponibles </strong></h5>
      <%= form.collection_select :buyer_id, User.where(user_type:"Comprador"), :id, :email %>

SELECT "users".* FROM "users" WHERE "users"."user_type" = ? ORDER BY "users"."id" ASC LIMIT ?  [["user_type", "Proveedor"], ["LIMIT", 1]]
---
      <h5><strong> Proveedores Disponibles </strong></h5>
      <%= form.collection_select :provider_id, User.where(user_type:"Proveedor"), :id, :email %>