ruby_app/app/views/orders/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
          <td><%= order.delivery_key %></td>
          <td><%= User.find(order.buyer_id).email%></td>
          <td><%= User.find(order.provider_id).email%></td>

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
          <% if order.dispatcher_id!=4%>
          <td><%= User.find(order.dispatcher_id).email%></td>

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
          <td><%= order.delivery_key %></td>
          <td><%= User.find(order.buyer_id).email%></td>
          <td><%= User.find(order.provider_id).email%></td>

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
          <td><%= order.delivery_key %></td>
          <td><%= User.find(order.buyer_id).email%></td>
          <td><%= User.find(order.provider_id).email%></td>
          <td><%= User.find(order.dispatcher_id).email%></td>