ruby_app/app/views/orders/new.html.erb

          <h5><strong>Lista de Proveedores </strong></h5>
          <%for comprador in User.where(user_type:"Proveedor")%>
---
SELECT "users".* FROM "users" WHERE "users"."user_type" = ?  [["user_type", "Proveedor"]]

        </div>
        <h5><strong>Proveedor: </strong><%=User.where(user_type:"Proveedor").first.email%></h5>
---
SELECT "users".* FROM "users" WHERE "users"."user_type" = ? ORDER BY "users"."id" ASC LIMIT ?  [["user_type", "Comprador"], ["LIMIT", 1]]

          <h5><strong>Lista de Compradores </strong></h5>
          <%for comprador in User.where(user_type:"Comprador")%>
---
SELECT "users".* FROM "users" WHERE "users"."user_type" = ? ORDER BY "users"."id" ASC LIMIT ?  [["user_type", "Comprador"], ["LIMIT", 1]]