ruby_app/app/views/orders/show.html.erb

SELECT "order_products".* FROM "order_products" WHERE "order_products"."order_id" = ?  [["order_id", 8]]
---
                <tbody>
                        <% @order.order_products.each do |resp| %>

SELECT "comments".* FROM "comments" WHERE "comments"."order_id" = ?  [["order_id", 8]]
---
                <tbody>
                <% @order.comments.each do |comment| %>