ruby_app/app/views/orders/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
        <h5><strong>Encargo: </strong><%=@order.id%></h5>
        <h5><strong>Comprador: </strong><%=User.find(@order.buyer_id).first_name%><%=" "%><%=User.find(@order.buyer_id).last_name%></h5>
        <h5><strong>Proveedor: </strong><%=User.find(@order.provider_id).first_name%><%=" "%><%=User.find(@order.provider_id).last_name%></h5>
        <h5><strong>Despachador: </strong><%=User.find(@order.dispatcher_id).first_name%><%=" "%><%=User.find(@order.dispatcher_id).last_name%></h5>

SELECT "order_products".* FROM "order_products" WHERE "order_products"."order_id" = ?  [["order_id", 1]]
---
                <tbody>
                        <% @order.order_products.each do |resp| %>

SELECT "comments".* FROM "comments" WHERE "comments"."order_id" = ?  [["order_id", 1]]
---
                <tbody>
                <% @order.comments.each do |comment| %>