ruby_app/app/views/order_products/_form.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."buyer_id" = ?  [["buyer_id", 1]]
---

  <%= form.collection_select :order_id, Order.where(buyer_id:current_user.id), :id, :delivery_key %>